//MDBOV    PROC
//GENOP    EXEC PGM=IEBGENER
//SYSPRINT DD SYSOUT=N
//*
//* MDB RPC BROKER MONITOR JOB
//*
//RPCMON EXEC PGM=IKJEFT01,DYNAMNBR=30,TIME=NOLIMIT,
//    PARM='RPCMONV'
//SYSEXEC  DD DSN=MDB.REXX.EXEC,DISP=SHR
//         DD DSN=MET.EXECFLIB,DISP=SHR
//SYSTSPRT DD SYSOUT=Q
//SYSTSIN  DD DUMMY
//
