//M12SCMKL JOB (M12,SC,WDS0BF),SCOX.6955,PRTY=8,MSGCLASS=Q
//*
//* TO BUILD MDBUFR from scratch
//*
//S1 EXEC FORT2CL,FPARMS='CHARLEN(28000),NOFIPS,DC(*)',LPARMS='MAP'
//*
//FORT.SYSIN DD DSN=MCC3.SCF95.SRCE(MDBUFR),DISP=SHR
//*
//LKED.SYSLMOD DD DSN=MCC3.DBLOAD.D220101(MDBUFR),DISP=SHR
//LKED.DB DD DSN=SDB.LOADLIB,DISP=SHR
//LKED.SYSIN DD *
 INCLUDE DB(MDB,BUFRSHEL)
 ENTRY MDBUFR
/*
//
