//T12DHCL1 JOB (M12,DH,WDS0BF),D.HIRST.X6955,
//  MSGCLASS=Q,TIME=(0,10),NOTIFY=T12DH,PRTY=??
//*
//*
//CL EXEC FORT2CL,
//*
//  FPARMS='NOFIPS',FPARMS2='CHARLEN(700),XREF,MAP,DC(*)',NAG=
//* FORT.SYSIN DD DSN=MCC3.DBSRCLIB(STNIDX??),DISP=SHR
//* FORT.SYSIN DD DSN=MCC3.DBREVSRC(STNIDX??),DISP=SHR
//*
//LKED.SYSLMOD DD DSN=MCC3.??LOAD.N?????(STNINDEX),DISP=OLD
//
