//T12SCUKS JOB (M12,SC,WDS0BF),SIMON.ROOMG08.X6955,
// PRTY=??,NOTIFY=T12SC,MSGCLASS=Q
// EXEC FORT2CL,FPARMS='NOFIPS,CHARLEN(29999),ICA'
//FORT.SYSIN DD DSN=MDB.SOURCE(UKSYNPCT),DISP=SHR
//*
//LKED.SYSLMOD DD DSN=MCC3.??LOAD(UKSYNPCT),DISP=SHR
//LKED.OBJMOD1 DD DSN=SDB.LOADLIB,DISP=SHR
//LKED.OBJMOD2 DD DSN=MET.PROGLIB,DISP=SHR
//LKED.SYSIN DD *
  INCLUDE OBJMOD1(MDB)
  INCLUDE OBJMOD2(REXXVAR,ZPDATE)
/*
//
