)ATTR
  %   TYPE(TEXT)  SKIP(ON) COLOR(WHITE)
  +   TYPE(TEXT)  SKIP(ON) COLOR(BLUE)
  _   TYPE(INPUT)          COLOR(RED)

)BODY
%TUTORIAL-----------+DATASET DESTINATION SELECTION MENU%----------      TUTORIAL
%COMMAND ===>_ZCMD                                                             +
+
+  This panel allows the user to re-browse, keep or print the browsable dataset
+ containing the retrieved data.
+
+  If the user wishes to re-browse the dataset, enter 'Y' at the BROWSE input
+ field and the dataset is displayed on the screen again.
+
+  If the user wishes to keep the dataset, enter 'Y' at the KEEP input field
+ and enter the new dataset name on the next input field. This allows the user
+ to rename the browsable dataset containing the retrieved data to allow the
+ data to be kept while another retrieval is executed. The user can input the
+ dataset name of their choice, up to 40 characters long. The normal system
+ prefix will be used if the dataset is not enclosed by quotes, or the entire
+ dataset name can be defined by putting the entire name within quotes. Note
+ that the dataset is catalogued on TMP003, and may be deleted after 24 hours
+ by the COSMOS clearing system. Therefore the renamed dataset should be copied
+ to another disk volume if the data is required for an indefinite period.
+
+  Press ENTER to continue or END to terminate the tutorial.
+
)PROC
     &ZUP= &ZHTOP       /* specify this panel as 'top' */
     &ZCONT=MDBTUDS2

)END
