)ATTR
      ! TYPE(OUTPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT)
)BODY
%-------------------Station Master Data Display --------------------------------
%COMMAND ===> _ZCMD                                                            +
+
+
+
+
+
+
+
+            Station%!CDENT +already exists.
+
+            It cannot be opened as a new station.
+
+
+
+
+
+
+
+
+
+      Press%ENTER+or%END+to go back to previous panel
)INIT
     .CURSOR = ZCMD   .HELP = STNHLP6
)PROC
)END
