)ATTR
      ! TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT)
)BODY
%----------------- STATION MASTER On-Line Help Display -------------------------
%COMMAND ===> _ZCMD                                                            +
+
+
+  This panel is displaying the following information :-
+
+  Station characteristic flags
+
+  1. Reopened Station         - this station has been reopened
+  2. Renumbered Station       - this station has been renumbered
+  3. Re issued Station Number - this station number has been re issued
+  4. Station has been renamed
+  5. Station position corrected
+  6. Station to be chased     - used by Met O (CC) chaser message pgm
+  7. Station has been reallocated
+  8. Aerodrome                - is it a civil or military aerodrome
+  9. Station Disposition      - is it a current station or historical
+ 10. Type                     - is it a manned, automatic & semi automatic
+ 11. Location                 - is it a land, coastal or sea station
+ 12. Regional National Reporting Practices available
+ 13. Principle Met Station
+
+              Press%END+to go back to selection
)INIT
     .CURSOR = ZCMD   .HELP = STNHLP4
)PROC
    &ZUP=STNHLP4
)END
