)ATTR
      ! TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT)
)BODY
%----------------- STATION MASTER On-Line Help Display -------------------------
%COMMAND ===> _ZCMD                                                            +
+
+
+       This panel is asking you how you would like to
+       access the station details.
+
+
+       The choices are :-
+
+
+       D - Display data from STATION MASTER on several successive
+           panels if one of the station identifiers is known.
+           Each element has a heading and there is a further
+           help panel for extra guidance
+
+       B - Display station list with normal browse facilities.
+           Use to find a station identifier i.e. WMO number,
+           ICAO id, DCNN number or RAINFALL number. You should
+           then revert back to option D to display the details
+           you require in a more user friendly manner.
+
+
+                Press%END+to go back to selection
)INIT
     .CURSOR = ZCMD
)PROC
    &ZUP=STNHLP1
 /* &ZCONT=STNHLP2 */
)END
