)ATTR
      ! TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT)
)BODY
%----------------- STATION MASTER On-Line Help Display -------------------------
%COMMAND ===> _ZCMD                                                            +
+
+
+  This panel is displaying the following information :-
+
+  HAWSON CORRECTION - correction needed for upper air
+                      reports (00z & 12z)   (missing data = 99999)
+
+  STATION CLASSIFICATION - the classification given to the reports
+                           from this station
+
+  MAP PRIORITY - this is the priority (between 1 & 5) given to each
+                 station for plotting purposes
+
+  CHASER BULLETIN   - the bulletin(s) this station is used in
+  RUNWAY DIRECTIONS - up to two runway directions in degrees & 10ths
+  5 DEGREE SQUARE   - 5 degree square in which station appears
+
+  OLD STATION RECORD - record number that old details can be found
+  NEW STATION RECORD - record number that new details can be found
+
+
+              Press%END+to go back to selection
)INIT
     .CURSOR = ZCMD   .HELP = STNHLP5
)PROC
    &ZUP=STNHLP5
)END
