//T12DHSYC JOB (M12,DB,WDS0BF),SDBTEAM.6953,PRTY=8,NOTIFY=T12DH,
//  MSGCLASS=Q
//*
//* SYSUT1 INPUT DATASET
//* SYSUT2 OUTPUT DATASET
//*                      USUALLY BACKUP TO OPER
//* OPR002  OPER
//* OPR007  BACKUP
//COPY EXEC PGM=IEBGENER
//SYSPRINT DD SYSOUT=Q
//SYSUT1   DD DSN=SDB.BSYNMAST.BACKUP,DISP=SHR
//SYSUT2   DD DSN=SDB.BSYNMAST,DISP=OLD
//SYSIN    DD DUMMY
//
