//M12CLASM JOB (M00,CL,WDS0BF),MDBTEAM.6953,PRTY=8,MSGCLASS=Q
// EXEC PGM=DISASM
//*
//* TO DISASSEMBLE A PROGRAM IN A LOAD MODULE:
//* SET LIBRARY & MEMBER NAME, & PROGRAM TOO IF NOT AT START OF LOAD
//* MODULE (LEAVE SPACE BETWEEN 8-CHAR MEMBER NAME & PROGRAM)
//*
//SYSPRINT DD SYSOUT=Q
//SYSLIB DD DSN=???????????,DISP=SHR
MEMBER.. PROGRAM
