//T12DBFR1 JOB (M12,JL,WDS0BF),MDBTEAM.X6954,MSGCLASS=Q,PRTY=8,
//         NOTIFY=T12JL
//*
//*  JOB TO ANALYSE TAPE LENGTH. ONLY CHANGE VOLSER.
//*
//FATAR1 EXEC  PGM=FATAR,REGION=4000K
//SYSPRINT  DD  SYSOUT=Q
//SYSUDUMP  DD  SYSOUT=Q
//TAPESUMM  DD  SYSOUT=Q
//TAPEIN  DD  DSNAME=MCC2.ANYNAME,DISP=SHR,LABEL=(,BLP),
//            VOL=SER=025899,UNIT=CART,EXPDT=98000
//SYSIN  DD  *
   ANALYZE
/*
