//M12DBOBS JOB (M12,DB,WDS0BF),SDBTEAM.6953,PRTY=8,MSGCLASS=Q
//*
//* INDEX PRINT FOR BATHY/TESAC, SATOBS ETC (ANYTHING STORED BY AMDSTO)
//*
// EXEC FORT2CLG,FPARMS='CHARLEN(28000)',TIMEG=(0,3),GOREGN=2000K
//SYSIN DD DSN=MDB.UTILITY.SRCE(MDBATHYX),DISP=SHR
//*              ****************
//*              ** Set DsName **
//GO.SUBSEA DD DSN=MDB.??????,DISP=SHR,LABEL=(,,,IN)
