//M12DBSTB JOB (M12,DB,WDS0BF),SDBTEAM.6953,PRTY=8,MSGCLASS=Q
//*
//* PRINT SATOB INDEX ENTRY BY ENTRY (MORE DETAIL THAN STATS)
//* (BLOCKSIZE=15476, 23-BYTE INDEX ENTRIES)
//*
// EXEC FORT2CLG,FPARMS='CHARLEN(28000)',TIME.GO=(,3)
//SYSIN DD DSN=MDB.UTILITY.SRCE(MDBSATOB),DISP=SHR
//GO.MDB DD DSN=MDB.SATOBS,DISP=SHR,LABEL=(,,,IN)
