//M12CLTAB JOB (M00,DB,WDS0BF),SDBTEAM.2410,PRTY=8,MSGCLASS=Q
//SDBPRINT EXEC PGM=SDBPRINT
//STEPLIB  DD DSN=SDB.LOADLIB,DISP=SHR
//GO.INCARD DD *
1 246
//GO.BANK DD DSN=SDB.M1993.D061700,DISP=SHR,UNIT=DISK,VOL=SER=OPR002
//GO.PRINT DD SYSOUT=Q
