//T12RW001 JOB (M12,RW,WDS0BF),SDBTEAM,TIME=(,8),MSGLEVEL=(1,1),
// NOTIFY=T12RW,MSGCLASS=Q,PRTY=8
//* MAIN DEADLINE=(1M,A)
//* JOB TO CHECK AN ARCHIVE TAPE
//*    CHANGE 2 THINGS  1) TAPE VOLUME SERIAL
//*                     2) DATASET NAME OF FIRST FILE ON TAPE
//*
// EXEC PGM=FATAR
//* STEPLIB DD DSN=M12.JPLIB,DISP=SHR
//SYSPRINT DD SYSOUT=Q
//TAPEIN DD UNIT=CART,LABEL=(1,SL),DISP=SHR,
// VOL=SER=012434,DSN=SDB.ABCLIMGL.GL910701
//SYSIN DD *
 ANALYZE FILES=0,HEX,KEEP
/*
//
