//T12DHWM5 JOB (M00,DB,WDS0BF),DATA.BANK.TEAM.X6955,PRTY=??,
// MSGLEVEL=(1,1),MSGCLASS=Q,NOTIFY=T12DH
//*
//*               WMO TAPE JOB 5
//*
//*    TO CREATE THE NEW ABBREVIATED STATION INDEX.
//*
//  EXEC  ASMHCLG
//ASM.SYSIN DD DSN=MCC3.DBSOURCE(LXABRIND),DISP=SHR
//GO.STIND DD DSN=MCC3.STATION.INDEX,DISP=SHR
//GO.STOUT DD DSN=MCC3.DBABRIN,DISP=OLD
//GO.SYSUDUMP   DD SYSOUT=Q
//
